TimeSeriesDDPM(
  (net): CNNNet(
    (cnn): Sequential(
      (0): Conv1d(2, 32, kernel_size=(3,), stride=(1,), padding=(1,))
      (1): ReLU()
      (2): Conv1d(32, 64, kernel_size=(3,), stride=(1,), padding=(1,))
      (3): ReLU()
    )
    (fc): Linear(in_features=64, out_features=1, bias=True)
  )
)
